cmsis-svd/cmsis-svd/data/Fujitsu/S6E2CC.svd
        <!-- REGISTER "ADST1" -->
        <register>
          <name>ADST1</name>
          <description>Sampling Time Setup Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX1" -->
            <field>
              <name>STX1</name>
              <description>Sampling time N times setting bits</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST1" -->
            <field>
              <name>ST1</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADST0" -->
        <register>
          <name>ADST0</name>
          <description>Sampling Time Setup Register 0</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX0" -->
            <field>
              <name>STX0</name>
              <description>Sampling time N times setting bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST0" -->
            <field>
              <name>ST0</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCT" -->
        <register>
          <name>ADCT</name>
          <description>Frequency Division Ratio Setup Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CT" -->
            <field>
              <name>CT</name>
              <description>Frequency division ratio setting bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRTSL" -->
        <register>
          <name>PRTSL</name>
          <description>Priority Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRTSL" -->
            <field>
              <name>PRTSL</name>
              <description>Priority conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCTSL" -->
        <register>
          <name>SCTSL</name>
          <description>Scan Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCTSL" -->
            <field>
              <name>SCTSL</name>
              <description>Scan conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCEN" -->
        <register>
          <name>ADCEN</name>
          <description>A/D Operation Enable Setup Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFF03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ENBLTIME" -->
            <field>
              <name>ENBLTIME</name>
              <description>Operation enable state transition cycle selection bits </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "READY" -->
            <field>
              <name>READY</name>
              <description>A/D operation enable state bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ENBL" -->
            <field>
              <name>ENBL</name>
              <description>A/D operation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMRCOT" -->
        <register>
          <name>WCMRCOT</name>
          <description>Range Comparison Threshold Excess Flag Register</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCOOF" -->
            <field>
              <name>RCOOF</name>
              <description>Threshold excess flag bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMRCIF" -->
        <register>
          <name>WCMRCIF</name>
          <description>Range Comparison Flag Register</description>
          <addressOffset>0x48</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCINT" -->
            <field>
              <name>RCINT</name>
              <description>Range comparison interrupt factor flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMPCR" -->
        <register>
          <name>WCMPCR</name>
          <description>Range Comparison Control Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCOCD" -->
            <field>
              <name>RCOCD</name>
              <description>Continuous detection specification count/state indication bits</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCOIRS" -->
            <field>
              <name>RCOIRS</name>
              <description>Selection bit of within-range and out-of- range confirmation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCOIE" -->
            <field>
              <name>RCOIE</name>
              <description>Range comparison interrupt request enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCOE" -->
            <field>
              <name>RCOE</name>
              <description>Range comparison execution enable bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMPSR" -->
        <register>
          <name>WCMPSR</name>
          <description>Range Comparison Channel Select Register</description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCMD" -->
            <field>
              <name>WCMD</name>
              <description>Comparison mode select bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCCH" -->
            <field>
              <name>WCCH</name>
              <description>Comparison target analog input channel</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMPDL" -->
        <register>
          <name>WCMPDL</name>
          <description>Lower Limit Threshold Setup Register</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFC0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMLD" -->
            <field>
              <name>CMLD</name>
              <description>Lower limit threshold bits</description>
              <lsb>6</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
