cmsis-svd/cmsis-svd/data/Fujitsu/S6E2CC.svd
        <!-- REGISTER "IF1MCTR" -->
        <register>
          <name>IF1MCTR</name>
          <description>IF1 Message Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description>NewDat</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSGLST" -->
            <field>
              <name>MSGLST</name>
              <description>MsgLst</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTPND" -->
            <field>
              <name>INTPND</name>
              <description>IntPnd</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UMASK" -->
            <field>
              <name>UMASK</name>
              <description>UMask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXIE" -->
            <field>
              <name>TXIE</name>
              <description>TxIE</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXIE" -->
            <field>
              <name>RXIE</name>
              <description>RxIE</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RMTEN" -->
            <field>
              <name>RMTEN</name>
              <description>RmtEn</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXRQST" -->
            <field>
              <name>TXRQST</name>
              <description>TxRqst</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOB" -->
            <field>
              <name>EOB</name>
              <description>EoB</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DLC" -->
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA1_L" -->
        <register>
          <name>IF1DTA1_L</name>
          <description>IF1 Data Registers A1</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_1_" -->
            <field>
              <name>DATA_1_</name>
              <description>Data(1)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_0_" -->
            <field>
              <name>DATA_0_</name>
              <description>Data(0)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA2_L" -->
        <register>
          <name>IF1DTA2_L</name>
          <description>IF1 Data Registers A2</description>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_3_" -->
            <field>
              <name>DATA_3_</name>
              <description>Data(3)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_2_" -->
            <field>
              <name>DATA_2_</name>
              <description>Data(2)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTB1_L" -->
        <register>
          <name>IF1DTB1_L</name>
          <description>IF1 Data Registers B1</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_5_" -->
            <field>
              <name>DATA_5_</name>
              <description>Data(5)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_4_" -->
            <field>
              <name>DATA_4_</name>
              <description>Data(4)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTB2_L" -->
        <register>
          <name>IF1DTB2_L</name>
          <description>IF1 Data Registers B2</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_7_" -->
            <field>
              <name>DATA_7_</name>
              <description>Data(7)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_6_" -->
            <field>
              <name>DATA_6_</name>
              <description>Data(6)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA2_B" -->
        <register>
          <name>IF1DTA2_B</name>
          <description>IF1 Data Registers A2</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_2_" -->
            <field>
              <name>DATA_2_</name>
              <description>Data(2)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_3_" -->
            <field>
              <name>DATA_3_</name>
              <description>Data(3)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA1_B" -->
        <register>
          <name>IF1DTA1_B</name>
          <description>IF1 Data Registers A1</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_0_" -->
            <field>
              <name>DATA_0_</name>
              <description>Data(0)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_1_" -->
            <field>
              <name>DATA_1_</name>
              <description>Data(1)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
