cmsis-svd/cmsis-svd/data/Fujitsu/S6E2CC.svd
        <!-- REGISTER "MHTRH" -->
        <register>
          <name>MHTRH</name>
          <description>MAC Hash Table Register (High)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTH" -->
            <field>
              <name>HTH</name>
              <description>the upper 32 bits of the hash table in the HTH</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MHTRL" -->
        <register>
          <name>MHTRL</name>
          <description>MAC Hash Table Register (Low)</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTL" -->
            <field>
              <name>HTL</name>
              <description>the lower 32 bits of the hash table in the HTL</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GAR" -->
        <register>
          <name>GAR</name>
          <description>GMII/MII Address Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Physical Layer Address</description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GR" -->
            <field>
              <name>GR</name>
              <description>GMII Register</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR" -->
            <field>
              <name>CR</name>
              <description>Application Clock Range</description>
              <lsb>2</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GW" -->
            <field>
              <name>GW</name>
              <description>GMII/MII Write</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GB" -->
            <field>
              <name>GB</name>
              <description>GMII/MII Busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GDR" -->
        <register>
          <name>GDR</name>
          <description>GMII/MII Data Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GD" -->
            <field>
              <name>GD</name>
              <description>GMII/MII Data Register</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FCR" -->
        <register>
          <name>FCR</name>
          <description>Flow Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF00BF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PT" -->
            <field>
              <name>PT</name>
              <description>Pause Time</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DZPQ" -->
            <field>
              <name>DZPQ</name>
              <description>Disable Zero-Quanta Pause</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLT" -->
            <field>
              <name>PLT</name>
              <description>Pause Low Threshold</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UP" -->
            <field>
              <name>UP</name>
              <description>Unicast Pause Frame detect</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFE" -->
            <field>
              <name>RFE</name>
              <description>Receive Flow Control Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFE" -->
            <field>
              <name>TFE</name>
              <description>Transmit Flow Control Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCB_BPA" -->
            <field>
              <name>FCB_BPA</name>
              <description>Flow Control Busy/Backpressure Activate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
