cmsis-svd/cmsis-svd/data/Fujitsu/S6E2CC.svd
        <!-- REGISTER "RDCSDC1" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC1</name>
          <description>Read Command Sequence Data/Control Register 1</description>
          <addressOffset>0xDE</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC2" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC2</name>
          <description>Read Command Sequence Data/Control Register 2</description>
          <addressOffset>0xE0</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC3" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC3</name>
          <description>Read Command Sequence Data/Control Register 3</description>
          <addressOffset>0xE2</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC4" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC4</name>
          <description>Read Command Sequence Data/Control Register 4</description>
          <addressOffset>0xE4</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC5" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC5</name>
          <description>Read Command Sequence Data/Control Register 5</description>
          <addressOffset>0xE6</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC6" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC6</name>
          <description>Read Command Sequence Data/Control Register 6</description>
          <addressOffset>0xE8</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC7" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC7</name>
          <description>Read Command Sequence Data/Control Register 7</description>
          <addressOffset>0xEA</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC0" -->
        <register>
          <name>WRCSDC0</name>
          <description>Write Command Sequence Data/Control Register 0</description>
          <addressOffset>0xEC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRCSDATA" -->
            <field>
              <name>WRCSDATA</name>
              <description>Write command sequencer data/control setting values</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONT" -->
            <field>
              <name>CONT</name>
              <description>Continuous instruction setting bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description>Serial interface width control bits</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEC" -->
            <field>
              <name>DEC</name>
              <description>Decode control bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WRCSDC1" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC1</name>
          <description>Write Command Sequence Data/Control Register 1</description>
          <addressOffset>0xEE</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC2" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC2</name>
          <description>Write Command Sequence Data/Control Register 2</description>
          <addressOffset>0xF0</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC3" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC3</name>
          <description>Write Command Sequence Data/Control Register 3</description>
          <addressOffset>0xF2</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC4" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC4</name>
          <description>Write Command Sequence Data/Control Register 4</description>
          <addressOffset>0xF4</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC5" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC5</name>
          <description>Write Command Sequence Data/Control Register 5</description>
          <addressOffset>0xF6</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC6" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC6</name>
          <description>Write Command Sequence Data/Control Register 6</description>
          <addressOffset>0xF8</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC7" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC7</name>
          <description>Write Command Sequence Data/Control Register 7</description>
          <addressOffset>0xFA</addressOffset>
        </register>
        <!-- REGISTER "MID" -->
        <register>
          <name>MID</name>
          <description>Module Identification Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000630</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MID" -->
            <field>
              <name>MID</name>
              <description>Module identification information bits</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QDCLKR" -->
        <register>
          <name>QDCLKR</name>
          <description>QDCLKR</description>
          <addressOffset>0x400</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0F</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QHDIV" -->
            <field>
              <name>QHDIV</name>
              <description>QHDIV</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DBCNT" -->
        <register>
          <name>DBCNT</name>
          <description>DBCNT</description>
          <addressOffset>0x404</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDBEN" -->
            <field>
              <name>TXDBEN</name>
              <description>TXDBEN</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDBEN" -->
            <field>
              <name>RXDBEN</name>
              <description>RXDBEN</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>
